heechul/DeepPicar-ESP32S3/src/app_httpd.cpp
            if (fb->format != PIXFORMAT_RGB565) {
                printf("fb->format=%s\n", (fb->format == PIXFORMAT_JPEG) ? "JPEG" : 
                    (fb->format == PIXFORMAT_GRAYSCALE) ? "GRAYSCALE" : 
                    (fb->format == PIXFORMAT_RGB888) ? "RGB888" : 
                    (fb->format == PIXFORMAT_YUV422) ? "YUV422" : "UNKNOWN");
            }

            if (g_use_dnn) 
            {
                long dur;
                // memset((void *)fb->buf, 0, fb->len); printf("Black image\n");
                // memset((void *)fb->buf, 0xFF, fb->len); printf("White image\n");
                GetImage(fb, nn->getInput());
                // memset((void *)(nn->getInput()->data.int8), -128, 3 * INPUT_W * INPUT_H);

                fr_pre = esp_timer_get_time();

                if (kTfLiteOk != nn->predict())
                {
                    printf("Invoke failed.\n");
                }
#if USE_INT8==1
                int q = nn->getOutput()->data.int8[0];
                float scale = nn->getOutput()->params.scale;
                int zero_point = nn->getOutput()->params.zero_point;
                float angle = (q - zero_point) * scale;
#else
                float angle = nn->getOutput()->data.f[0];
#endif
                fr_dnn = esp_timer_get_time();

                int deg = (int)rad2deg(angle);
                
                if (deg < 10 and deg > -10) 
                {
                    center();
                    printf("center (%d) by CPU", deg);
                } 
                else if (deg >= 10) 
                {
                    right();
                    printf("right (%d) by CPU", deg);
                } 
                else if (deg <= -10) 
                {
                    left();
                    printf("left (%d) by CPU", deg);
                }
                printf(": angle=%.3f q=%d\n", angle, q);

                fb_data_t rfb;
                rfb.width = fb->width;
                rfb.height = fb->height;
                rfb.data = fb->buf;
                rfb.bytes_per_pixel = 2;
                rfb.format = FB_RGB565;

                fb_gfx_printf(&rfb, 0, 0, COLOR_BLUE, "AI: %3d %s", deg, 
                    (deg < 10 and deg > -10) ? "C" : (deg >= 10) ? "R" : "L");
            }

            if (fb->format != PIXFORMAT_JPEG)
            {
                bool jpeg_converted = frame2jpg(fb, 80, &_jpg_buf, &_jpg_buf_len);

                esp_camera_fb_return(fb);
                fb = NULL;
                if (!jpeg_converted)
                {
                    log_e("JPEG compression failed");
                    res = ESP_FAIL;
                }
            }
            else
            {
                _jpg_buf_len = fb->len;
                _jpg_buf = fb->buf;
            }
            fr_enc = esp_timer_get_time();
        }
        if (res == ESP_OK)
        {
            res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
        }
        if (res == ESP_OK)
        {
            size_t hlen = snprintf((char *)part_buf, 128, _STREAM_PART, _jpg_buf_len, _timestamp.tv_sec, _timestamp.tv_usec);
            res = httpd_resp_send_chunk(req, (const char *)part_buf, hlen);
        }
        if (res == ESP_OK)
        {
            res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);
        }
    out:
        if (fb)
        {
            esp_camera_fb_return(fb);
            fb = NULL;
            _jpg_buf = NULL;
        }
        else if (_jpg_buf)
        {
            free(_jpg_buf);
            _jpg_buf = NULL;
        }
        if (res != ESP_OK)
        {
            log_e("Send frame failed");
            break;
        }
        int64_t fr_end = esp_timer_get_time();

#if CONFIG_ESP_FACE_DETECT_ENABLED && ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
        int64_t ready_time = (fr_ready - fr_start) / 1000;
        int64_t face_time = (fr_face - fr_ready) / 1000;
        int64_t recognize_time = (fr_recognize - fr_face) / 1000;
        int64_t encode_time = (fr_encode - fr_recognize) / 1000;
        int64_t process_time = (fr_encode - fr_start) / 1000;
#endif

        int64_t frame_time = (fr_end - last_frame)/1000;
        if (0 /* g_use_dnn */) printf("  %ums (%.1ffps): cap=%dms, pre=%dms, dnn=%dms, enc=%dms\n", 
            (uint32_t)frame_time, 1000.0 / (uint32_t)frame_time, 
            (int)((fr_cap-last_frame)/1000), (int)((fr_pre-fr_cap)/1000), (int)((fr_dnn-fr_pre)/1000), (int)((fr_enc-fr_dnn)/1000));

        last_frame = fr_end;

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
        uint32_t avg_frame_time = ra_filter_run(&ra_filter, frame_time);
#endif
        log_i("MJPG: %uB %ums (%.1ffps), AVG: %ums (%.1ffps)"
#if CONFIG_ESP_FACE_DETECT_ENABLED
                      ", %u+%u+%u+%u=%u %s%d"
#endif
                 ,
                 (uint32_t)(_jpg_buf_len),
                 (uint32_t)frame_time, 1000.0 / (uint32_t)frame_time,
                 avg_frame_time, 1000.0 / avg_frame_time
#if CONFIG_ESP_FACE_DETECT_ENABLED
                 ,
                 (uint32_t)ready_time, (uint32_t)face_time, (uint32_t)recognize_time, (uint32_t)encode_time, (uint32_t)process_time,
                 (detected) ? "DETECTED " : "", face_id
#endif
        );
    }

#if CONFIG_LED_ILLUMINATOR_ENABLED
    isStreaming = false;
    enable_led(false);
#endif

    return res;
}

static esp_err_t parse_get(httpd_req_t *req, char **obuf)
{
    char *buf = NULL;
    size_t buf_len = 0;

    buf_len = httpd_req_get_url_query_len(req) + 1;
    if (buf_len > 1) {
        buf = (char *)malloc(buf_len);
        if (!buf) {
            httpd_resp_send_500(req);
            return ESP_FAIL;
        }
        if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
            *obuf = buf;
            return ESP_OK;
        }
        free(buf);
    }
    httpd_resp_send_404(req);
    return ESP_FAIL;
}

static esp_err_t cmd_handler(httpd_req_t *req)
{
    char *buf = NULL;
    char variable[32];
    char value[32];

    if (parse_get(req, &buf) != ESP_OK) {
        return ESP_FAIL;
    }
    if (httpd_query_key_value(buf, "var", variable, sizeof(variable)) != ESP_OK ||
        httpd_query_key_value(buf, "val", value, sizeof(value)) != ESP_OK) {
        free(buf);
        httpd_resp_send_404(req);
        return ESP_FAIL;
    }
    free(buf);

